<details><summary>Digger run report at 2024-01-28 13:17:11 (UTC)</summary>
    <details><summary>Plan for <b>ssmiller25/civo-digger#core-cluster</b></summary>
  
```terraform
Terraform will perform the following actions:

  # civo_firewall.core-firewall will be created
  + resource "civo_firewall" "core-firewall" {
      + create_default_rules = true
      + id                   = (known after apply)
      + name                 = "core"
      + network_id           = (known after apply)
      + region               = (known after apply)

      + ingress_rule {
          + action     = "allow"
          + cidr       = [
              + "0.0.0.0/8",
            ]
          + id         = (known after apply)
          + label      = "k8s"
          + port_range = "6443"
          + protocol   = "tcp"
        }
    }

  # civo_kubernetes_cluster.core-cluster will be created
  + resource "civo_kubernetes_cluster" "core-cluster" {
      + api_endpoint           = (known after apply)
      + cluster_type           = (known after apply)
      + cni                    = (known after apply)
      + created_at             = (known after apply)
      + dns_entry              = (known after apply)
      + firewall_id            = (known after apply)
      + id                     = (known after apply)
      + installed_applications = (known after apply)
      + kubeconfig             = (sensitive value)
      + kubernetes_version     = (known after apply)
      + master_ip              = (known after apply)
      + name                   = "core2"
      + network_id             = (known after apply)
      + num_target_nodes       = (known after apply)
      + ready                  = (known after apply)
      + region                 = (known after apply)
      + status                 = (known after apply)
      + target_nodes_size      = (known after apply)

      + pools {
          + instance_names      = (known after apply)
          + label               = "front-end"
          + node_count          = 3
          + public_ip_node_pool = (known after apply)
          + size                = "g4s.kube.xsmall"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>

<details><summary>Terraform plan validation check (core-cluster)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>